/**
 * 카페 소스 불러올때 정의값 저장
 */

var cafe = {
		mainTitleList : ["게임","만화/애니메이션","방송/연예","문화/예술","영화","음악","팬카페","여행","스포츠/레저","반려동물/동물","취미","생활","패션/미용","건강/다이어트","가족/육아","컴퓨터/통신","교육","외국어","인문/과학","경제/금융","정치/사회","문학/창작","동창/동문","친목/모임","종교/봉사"],
		subTitleList : [
			["롤플레잉","시뮬레이션","FPS/슈팅","액션/어드벤처","레이싱","스포츠","모바일","비디오 게임기","게이머/게임제작","길드/클랜","게임일반"],
			["순정/드라마","코믹","액션/무협","공포/추리","판타지/SF","스포츠","웹툰","제작","만화일반"],
			["TV방송","라디오방송","인터넷방송","신문/잡지","연예정보","오디션","방송일반"],
			["연극","뮤지컬/오페라","무용/댄스","회화","공예/장식미술","조소/도예","서예","디자인","건축","사진","미술관/박물관","문화/예술일반"],
			["드라마/로맨스영화","코미디영화","액션/무협영화","공포/스릴러영화","SF/판타지","다큐멘터리영화","고전/역사영화","인디/예술영화","영화제작","영화관/극장","영화제/영화평론","영화일반"],
			["발라드","힙합/댄스음악","팝/R&amp;B","록/메탈음악","인디음악","재즈/뉴에이지음악","클래식음악","성악/오페라음악","국악/민속음악","OST","음악이론/평론","작곡/작사","노래/연주","콘서트/가요제","악기/악보","음악일반","뮤직비디오"],
			["국내배우","해외배우","국내가수","해외가수","국내모델","해외모델","스포츠선수","음악가","예능인","개그맨","아나운서","만화작가","기타"],
			["국내여행","일본","중국","동남아시아","미주","남태평양","유럽","인도/아프리카","배낭여행","호텔/리조트","항공","여행일반"],
			["자동차","축구","야구","농구","배구","테니스/배드민턴","골프","탁구/당구","수영","마라톤/달리기","스키/보드","스케이트","태권도","유도/합기도","씨름/레슬링","복싱","검도","체조","모터스포츠","올림픽/아시안게임","자전거","등산/낚시","스포츠기타"],
			["개/강아지","고양이","햄스터","기니피그","토끼","고슴도치","새/조류","어류/갑각류","파충류/양서류","곤충류/거미","동물병원","동물보호","반려동물/동물일반"],
			["수집","모형","수공예","원예","코스프레","바둑/장기","마술","놀이오락","이색취미","취미일반"],
			["맛집","요리","인테리어","주거살림","교통","생활가전","생활정보","운세/풍수지리","중고용품","생활일반"],
			["의류","패션잡화","쥬얼리/액세서리","명품","피부관리","헤어/네일","화장/향수","성형","패션/미용일반"],
			["식생활/식습관","운동","건강관리/건강식품","다이어트","질병/증상","의료기관","심리상담","한방/대체의학","건강/다이어트일반"],
			["결혼","아동복지/입양","부부","임신/출산","육아/여성","가족/가족행사","이민","가족/육아일반"],
			["홈페이지/태그","프로그래밍언어","통신/네트워크","웹디자인/웹기획","운영체제","소프트웨어","하드웨어","멀티미디어","보안","무선/모바일","컴퓨터일반"],
			["영유아교육","초등학교교육","중학교교육","고등학교교육","대학교육","특수교육","직업교육","평생교육","유학/어학연수","학원/과외","시험/자격증","교육방법/정책","교육일반"],
			["영어","일어","중국어","프랑스어","독일어","스페인어","러시아어","이탈리아어","포르투갈어","기타외국어","통역/번역"],
			["철학","역사","심리학","수학","물리학","화학/화학공학","지구과학/천문학","생물학","생명공학","재료공학","전기/전자공학","건축/토목공학","농림/축산","의학","인문/과학일반"],
			["증권","보험","재테크","부동산","세금/세무","기업/산업","경영","광고/마케팅","무역","취업/창업","경제동향/경제이론","경제기관/단체","경제/금융일반"],
			["법","행정/민원","정치/선거","국제관계/통일","국방/병역","환경/재난재해","복지/인권","사회문화","정치/사회일반"],
			["시","소설/인터넷소설","수필","희곡/시나리오","독서/평론","문학창작","작가/문인","아동문학","출판/서점","외국문학","문학/창작일반"],
			["초등학교","중학교","고등학교","대학교/대학원","학원","동창/동문일반"],
			["띠","나이/또래","가족","군대","연인/친구","회사모임","업종/직종","동아리/조모임","이색/엽기","친목/모임일반","모바일"],
			["가톨릭","개신교","불교","소규모종교","자원봉사/자선"]
			],
		mainRegionList : ["서울특별시 ","경기도 ","인천광역시 ","부산광역시 ","대전광역시 ","대구광역시 ","울산광역시 ","광주광역시 ","강원도 ","충청북도 ","충청남도 ","경상북도 ","경상남도 ","전라북도 ","전라남도 ","제주특별자치도 ","세종특별자치시 ","아시아 ","유럽 ","미주/오세아니아 ","아프리카"],
		subRegionList : [
							["강남구","강동구","강북구","강서구","관악구","광진구","금천구, 구로구","노원구","도봉구","동대문구","동작구","마포구","서대문구","서초구","성동구","성북구","송파구","양천구","영등포구","은평구","종로구","중구, 용산구","중랑구","전체"],
							["고양시","과천시","광명시","광주시","구리시, 하남시","군포시","김포시","남양주시","동두천시, 양주시","부천시","성남시","수원시","시흥시","안산시","안성시, 평택시","안양시","연천군, 포천시","오산시","용인시, 의왕시","의정부시","이천시, 여주시","파주시","화성시","가평군, 양평군","전체"],
							["강화군, 서구","계양구","남구","남동구","동구, 중구","부평구","옹진군, 연수구","전체"],
							["강서구, 사상구","금정구, 기장군","남구, 수영구","동구, 서구","동래구","부산진구","북구","사하구","연제구","영도구, 중구","해운대구","전체"],
							["대덕구","동구","서구","유성구","중구","전체"],
							["남구","달서구","달성군","동구","북구","서구","수성구","중구","전체"],
							["남구","동구, 북구","울주군, 중구","전체"],
							["광산구","남구","동구","북구","서구","전체"],
							["강릉시","동해시, 삼척시","속초시, 태백시","원주시","춘천시","고성군, 인제군","정선군, 홍천군","양구군, 양양군","영월군, 평창군","철원군, 화천군","횡성군","전체"],
							["제천시","청주시","충주시","괴산군, 증평군","단양군","보은군, 청원군","영동군, 옥천군","음성군, 진천군","전체"],
							["계룡시, 논산시","공주시","보령시, 서산시","아산시","천안시","금산군, 연기군","당진군, 예산군","부여군, 서천군","청양군, 홍성군","태안군","전체"],
							["경산시","경주시, 영천시","구미시","김천시","문경시, 상주시","안동시","영주시","포항시","고령군, 성주군","군위군, 청도군","봉화군, 영양군","영덕군, 청송군","예천군, 의성군","울릉군, 울진군","칠곡군","전체"],
							["거제시","김해시","밀양시","양산시","진주시","통합창원시","고성군, 남해군","거창군, 합천군","사천시, 통영시","산청군, 함양군","창녕군","하동군","함안군, 의령군","전체"],
							["군산시","김제시, 정읍시","남원시","익산시","전주시","고창군, 부안군","무주군, 장수군","순창군, 임실군","완주군, 진안군","전체"],
							["광양시","나주시","목포시","순천시","여수시","강진군, 장흥군","고흥군, 보성군","곡성군, 화순군","구례군, 광양시","신안군, 무안군","영광군, 함평군","영암군, 해남군","장성군, 담양군","진도군, 완도군","전체"],
							["서귀포시","제주시","전체"],
							["전체"],
							["필리핀","홍콩","베트남","일본","중국","말레이시아","몰디브","몽골","태국","인도네시아","싱가포르","기타"],
							["영국","러시아","이탈리아","독일","스위스","그리스","프랑스","터키","스페인","포르투갈","폴란드","네덜란드","벨기에","스웨덴","덴마크","핀란드","체코","기타"],
							["미국","캐나다","브라질","아르헨티나","멕시코","페루","아이티","호주","뉴질랜드","기타"],
							["남아프리카공화국","모로코","케냐","나이지리아","탄자니아","리비아","모리셔스","기타"]
							
						]
};


(function() {
	var path = window.location.pathname.substring(0, window.location.pathname.indexOf("/",2));
	// /cafe 이후에 아무것도 없을때
	if(path.length == 0) {
		var registerUi = document.getElementsByClassName("btn_cafe_make")[0];
		registerUi.href = "/cafe/register";
		
		
	} else {
		
	}
	
	
	
})();

